In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\lamad\anaconda3\lib\site-packages (8.3.0)

In [2]:
import mysql.connector
#importing database
database = mysql.connector.connect(
    host= "localhost",
    user= "root",
    password= "",
    database = "python3pm"
)
db = database.cursor()

In [10]:
db.execute("SELECT * FROM student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 98, 85, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 85, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(11, 'Rama', 89, 45, 65, 87, 78, 364, 72.8, 'B')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(15, 'bina', 55, 66, 22, 90, 44, 656, 66.25, 'B')
(16, 'binita', 95, 56, 92, 90, 99, 856, 88.25, 'A')
(20, 'binita', 95, 56, 92, 90, 99, 856, 88.25, 'A')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [11]:
db.execute("SELECT sn,name,total,grade FROM student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 420, 'A')
(3, 'Nabin', 430, 'A')
(4, 'Shiva', 400, 'A')
(8, 'Ram', 415, 'A')
(10, 'Sameer', 412, 'A')
(11, 'Rama', 364, 'B')
(12, 'Ram', 407, 'A')
(13, 'Gauri', 431, 'A')
(15, 'bina', 656, 'B')
(16, 'binita', 856, 'A')
(20, 'binita', 856, 'A')
(40, 'Hari', 412, 'A')

In [12]:
db.execute("SELECT * FROM student WHERE grade = 'A'")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 98, 85, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 85, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(16, 'binita', 95, 56, 92, 90, 99, 856, 88.25, 'A')
(20, 'binita', 95, 56, 92, 90, 99, 856, 88.25, 'A')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [16]:
# insert
sql = """INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) VALUES ('50', 'binita', '95', '56', '92', '90', '99', '856', '88.25', 'A');"""
db.execute(sql)
database.commit()

In [3]:
sn = int(input("Enter sn ="))
name = input("Enter name =")
physics = int(input("Enter marks ="))
chemistry = int(input("Enter marks ="))
math = int(input("Enter marks ="))
english = int(input("ENter marks ="))
nepali = int(input("ENter marks ="))
total = physics + chemistry + math + english + nepali
per = total/5

if per >=80:
    grade = "A"
elif per >=60:
    grade = "B"
elif per >=50:
    grade = "C"
else:
    grade = "F"
    
sql = f'''INSERT INTO student(sn,name,physics,chemistry,math,english,nepali,total,per,grade)
VALUES ({sn},'{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')'''
db.execute(sql)
database.commit()

Enter sn =90
Enter name =bioo
Enter marks =50
Enter marks =70
Enter marks =90
ENter marks =60
ENter marks =70

In [4]:
#UPDATE
sql = "UPDATE student SET physics = 90 WHERE sn = 3"
db.execute(sql)
database.commit()

In [9]:
subject = input("Enter subject = ")
marks = int(input("Enter marks ="))
sn = int(input("ENter sn = "))

sql = f"UPDATE student SET {subject} = {marks} WHERE sn = {sn}"
db.execute(sql)
database.commit()

Enter subject = math
Enter marks =80
ENter sn = 1

In [10]:
print(sql) # to check mistake in the data, paste the below data in sql local host

UPDATE student SET math = 80 WHERE sn = 1

In [6]:
#delete
sql = "DELETE from student WHERE sn = 50"
db.execute(sql)
database.commit()

In [7]:
#delete
sn = int(input("Enter sn = "))
sql = f"DELETE from student WHERE sn = {sn}"
db.execute(sql)
database.commit()

Enter sn = 16

In [ ]:
# create read operate delete